1s/ERP/Conf/Catalogs/Лико_НастройкиОтображенияПланаБЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_НастройкиОтображенияПланаБЭ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПоляТаблицы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СайтВидимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СайтВидимостьРасшифровка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_НастройкиОтображенияПланаБЭ/Ext/ManagerModule.bsl
Функция ПолучитьМассивНастроек(Настройка=Неопределено) Экспорт //+Лико m.shenderov 27.12.2021
	 УстановитьПривилегированныйРежим(Истина); 	
	Массив = Новый Массив();
	Настройка = ?(Настройка=Неопределено,Справочники.НастройкиОтображенияПлана.Основная,Настройка);
	
	Для каждого Запись Из Настройка.ПоляТаблицы Цикл
		Структура = Новый Структура;
		Структура.Вставить("Имя",Запись.Имя);
		Структура.Вставить("Заголовок",Запись.Заголовок);
		Структура.Вставить("Ширина",Запись.Ширина);
		Структура.Вставить("Видимость",Запись.Видимость);
		Структура.Вставить("Шаблон",Запись.Шаблон);
		Структура.Вставить("СайтВидимость",Запись.СайтВидимость);
        Структура.Вставить("СайтВидимостьРасшифровка",Запись.СайтВидимостьРасшифровка);

		Массив.Добавить(Структура);		
	КонецЦикла; 
	
	Возврат Массив;
	
	
КонецФункции //-Лико m.shenderov 27.12.2021
